package nekoqq.task.mabinogi.constant;

import java.util.HashMap;


/**
 * 走私信息中日文对照
 */
public class SmuggleTranslate {
    
    private SmuggleTranslate(){}
    
    
    public static HashMap<String, String> SmuggleWordMap = new HashMap<String, String>(){
        {
            put("アブネアネア湖の北西", "内尔湖西北");
            put("アブネアネア湖の南東", "内尔湖东南");
            put("アブネアネア湖西", "内尔湖西");
            put("アブネアネア湖の南西", "内尔湖西南");
            put("ブラゴ平原レザール醸造場", "列扎尔酿酒厂");
            put("ブラゴ平原東", "布拉格平原东");
            put("ブラゴ平原の北西", "布拉格平原西北");
            put("ブラゴ平原北", "布拉格平原北");
            put("ガイレフの丘ラインアルトの南東", "盖尔茨丘陵东南");
            put("ガイレフの丘ラインアルトの南", "盖尔茨丘陵南");
            put("トゥガルドアイル伐採キャンプ東", "菲奥娜地下城边");
            put("コリブ渓谷北", "考利芙峡谷北");
            put("コリブ渓谷南", "考利芙峡谷南");
            put("スリアブクィリンの岩石地帯東", "斯利比岩石地带东");
            put("スリアブクィリンの岩石地帯", "斯利比岩石地带");
            put("スリアブクィリン西", "斯利比西");
            put("スリアブクィリンの岩石地帯西", "斯利比岩石地带西南");
            put("タルティーン南", "塔汀南");
            put("タルティーンの南西", "塔汀西南");
            put("タルティーンストーンヘンジ西", "塔汀巨石群西");
            put("タルティーン墓地", "菲奥娜地下城边");
            put("トゥガルドアイル伐採キャンプ東", "塔汀墓地");
            put("センマイ平原北", "仙魔平原北");
            put("センマイ平原ペッカダンジョン", "皮卡地下城边");
            put("センマイ平原の南東", "仙魔平原东南");
            put("センマイ平原南", "仙魔平原南");
            put("センマイ平原の北西", "仙魔平原西北");
            put("トゥガルドアイルの東", "杜加德走廊东");
            put("トゥガルドアイルの南東", "杜加德走廊东南");
            put("トゥガルドアイルの南", "杜加德走廊南");
            
            
            
            put("ベビーポーション (ティルコネイル)", "婴儿药水(迪尔科内尔)");
            put("ダイエットポーション (ティルコネイル)", "减肥药水(迪尔科内尔)");
            put("いびき防止ポーション (ティルコネイル)", "预防打鼾药(迪尔科内尔)");
            put("人参ポーション (ティルコネイル)", "人参药水(迪尔科内尔)");
            put("蜘蛛の糸グローブ (ダンバートン)", "蜘蛛丝手套(敦巴伦)");
            put("羊毛ブーツ (ダンバートン)", "羊毛靴(敦巴伦)");   
            put("オーガキラーの仮面 (ダンバートン)", "食人魔屠夫假面(敦巴伦)");
            put("インキュバススーツ (ダンバートン)", "男妖正装(敦巴伦)");
            put("バンホール産石炭 (バンホール)", "班格的煤炭(班格)");
            put("大理石 (バンホール)", "大理石(班格)");
            put("黄水晶 (バンホール)", "黄水晶(班格)");
            put("ハイランダー鉱石 (バンホール)", "苏格兰高地矿石(班格)");
            put("ベリーグラノーラ (イメンマハ)", "威化(艾明码恰)");
            put("バタービール (イメンマハ)", "啤酒(艾明码恰)");
            put("野生動物の燻製 (イメンマハ)", "熏制的野味(艾明码恰)");
            put("トリュフパスタ (イメンマハ)", "蘑菇意大利面(艾明码恰)");
            put("熱気の結晶 (タルティーン)", "热气结晶(塔汀)");
            put("オルゴール保存石 (タルティーン)", "音乐盒保存石(塔汀)");
            put("パララの結晶 (タルティーン)", "帕拉鲁结晶(塔汀)");
            put("円形防護壁の結晶 (タルティーン)", "环形栅栏结晶(塔汀)");
            put("ミニ化粧台 (タラ)", "迷你梳妆台(塔拉)");
            put("ティーテーブル (タラ)", "茶几(塔拉)");
            put("ロッキングチェア (タラ)", "摇椅(塔拉)");
            put("子供用2段ベッド (タラ)", "儿童双层床(塔拉)");
            put("カブ産海苔 (カブ)", "卡普海苔(卡普港口)");
            put("カブ产カキ (カブ)", "卡普海贝(卡普港口)");
            put("フカヒレ (カブ)", "鲨鱼翅(卡普港口)");
            put("ゼリークラゲ (カブ)", "海蜇(卡普港口)");
            put("鉄鞭 (ベルファスト)", "铁鞭(贝尔法斯特)");
            put("ダークソード (ベルファスト)", "黑光剑(贝尔法斯特)");
            put("金庫 (ベルファスト)", "金库(贝尔法斯特)");
            put("スケルトンオーガアーマー (ベルファスト)", "骷髅食人魔铠甲(贝尔法斯特)");


            
        }
    };

}
